hydrogenReactingFlow/Coarse/0.orig/X_O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      X_O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 0 0 0 0 0 0];

internalField   uniform $X_O2;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $X_O2;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    walls
    {
        type            zeroGradient;
    }
    
    #include "include/boundaries"
}


// ************************************************************************* //
