hydrogenReactingFlow/Coarse/constant/thermo2TModel
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo2TModel;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermalRelaxationModels
{
    VT
    {
        relaxationType        LandauTellerVT;
        model                 LeMANSMWP;
        fullCoeffsForm        on;
        overwriteDefault      on;
        speciesDependent      on;
        collidingPair         on;
    }
    
    VV
    {
        relaxationType        noVVEnergyTransfer;
        model                 Knab;
        overwriteDefault      on;
        speciesDependent      on;
        collidingPair         on;
    }
    
    he
    {
        relaxationType        noHEEnergyTransfer;
    }
    
    eV
    {
        relaxationType        noeVEnergyTransfer;
        model                 BourdonVervisch;
        overwriteDefault      off;
        speciesDependent      off;
    }
}


// V-T Models
//-----------

MillikanWhiteCoefficients
{
    allSpecies
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      221.53;
        Bij      0.029;
        offset   18.42;
    }
    
    N2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      221.53;
        Bij      0.029;
        offset   18.42;
    }
    
    N2_O2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      228.76; 
        Bij      0.0295;
        offset   18.42;
    }
    
    N2_N
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      180.88; 
        Bij      0.0262;
        offset   18.42;
    }
    
    N2_O
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      72.4; 
        Bij      0.015;
        offset   18.42;
    }
    
    N2_NO
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      225.3; 
        Bij      0.0293;
        offset   18.42;
    }
    
    O2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      135.91;
        Bij      0.03;
        offset   18.42;
    }
    
    O2_N2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      131.32; 
        Bij      0.0295;
        offset   18.42;
    }
    
    O2_N
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      72.4; 
        Bij      0.015;
        offset   18.42;
    }
    
    O2_O
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      47.7;
        Bij      0.059;
        offset   18.42;
    }
    
    O2_NO
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      133.71;
        Bij      0.0298;
        offset   18.42;
    }
    
    NO
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      49.5;
        Bij      0.042;
        offset   18.42;
    }
    
    NO_N2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      49.5;
        Bij      0.042;
        offset   18.42;
    }
    
    NO_O2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      49.5;
        Bij      0.042;
        offset   18.42;
    }
    
    NO_N
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      49.5;
        Bij      0.042;
        offset   18.42;
    }
    
    NO_O
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      49.5;
        Bij      0.042;
        offset   18.42;
    }
}


ParkCoefficients
{
    allSpecies
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      221.53;
        Bij      0.029;
        offset   18.42;
        sigma1   1.0e-21;
        sigma2   5.0e4;
    }
    
    N2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      221.53;
        Bij      0.029;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2_O2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      228.76; 
        Bij      0.0295;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2_N
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      180.88; 
        Bij      0.0262;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2_O
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      72.4; 
        Bij      0.015;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2_NO
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      225.3; 
        Bij      0.0293;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2_N2+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      221.53;
        Bij      0.029;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2_O2+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      228.76;
        Bij      0.0295;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2_N+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      180.88;
        Bij      0.0262;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2_O+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      180.89;
        Bij      0.0268;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2_NO+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      225.3;
        Bij      0.0293;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2_e-
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      1.39;
        Bij      0.0023;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      135.91;
        Bij      0.03;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2_N2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      131.32; 
        Bij      0.0295;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2_N
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      72.4; 
        Bij      0.015;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2_O
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      47.7;
        Bij      0.059;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2_NO
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      133.71;
        Bij      0.0298;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2_N2+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      131.32;
        Bij      0.0295;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2_O2+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      135.91;
        Bij      0.03;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2_N+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      106.06;
        Bij      0.0265;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2_O+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      110.97;
        Bij      0.0271;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2_NO+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      133.71;
        Bij      0.0298;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2_e-
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      0.8;
        Bij      0.0023;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      49.5;
        Bij      0.042;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO_N2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      49.5;
        Bij      0.042;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO_O2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      49.5;
        Bij      0.042;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO_N
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      49.5;
        Bij      0.042;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO_O
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      49.5;
        Bij      0.042;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO_N2+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      175.67;
        Bij      0.0293;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO_O2+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      181.6;
        Bij      0.0298;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO_N+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      142.62;
        Bij      0.0264;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO_O+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      149.08;
        Bij      0.027;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO_NO+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      178.76;
        Bij      0.0295;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO_e-
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      1.08;
        Bij      0.0023;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      221.53;
        Bij      0.029;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2+_N2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      221.53; 
        Bij      0.029;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2+_O2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      228.76; 
        Bij      0.0295;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2+_N
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      180.88; 
        Bij      0.0262;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2+_O
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      188.89; 
        Bij      0.0268;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2+_NO
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      225.3; 
        Bij      0.0293;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2+_O2+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      228.75;
        Bij      0.0295;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2+_N+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      180.88;
        Bij      0.0262;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2+_O+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      188.88;
        Bij      0.0268;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2+_NO+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      225.3;
        Bij      0.0293;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2+_e-
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      1.39;
        Bij      0.0023;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      135.9;
        Bij      0.03;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2+_N2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      131.32; 
        Bij      0.0295;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2+_N
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      106.06; 
        Bij      0.0265;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2+_O
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      110.97;
        Bij      0.0271;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2+_NO
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      133.71;
        Bij      0.0298;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2+_N2+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      131.32;
        Bij      0.0295;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2+_N+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      106.05;
        Bij      0.0265;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2+_O+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      110.97;
        Bij      0.0271;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2+_NO+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      133.7;
        Bij      0.0298;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    O2_e-
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      0.8;
        Bij      0.0023;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      178.76;
        Bij      0.0295;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO+_N2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      175.67;
        Bij      0.0293;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO+_O2
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      181.61;
        Bij      0.0298;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO+_N
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      142.62;
        Bij      0.0264;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO+_O
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      149.09;
        Bij      0.027;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO+_N2+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      175.67;
        Bij      0.0293;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO+_O2+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      181.6;
        Bij      0.0298;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO+_N+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      142.62;
        Bij      0.0264;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO+_O+
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      149.08;
        Bij      0.027;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    NO+_e-
    {
        preAij   1.16e-3;
        preMij   0.015;
        Aij      1.08;
        Bij      0.0023;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    // Involving carbon compounds (Park 1994)
    CO2
    {
        Aij      36.5;
        Bij      -0.0193;
        offset   18.42;
        sigma1   1.0e-20;
        sigma2   5.0e4;
    }
    
    CO2_N
    {
        Aij      35.8;
        Bij      0.0271;
        offset   18.42;
        sigma1   1.0e-20;
        sigma2   5.0e4;
    }
    
    CO2_O
    {
        Aij      37.6;
        Bij      0.0278;
        offset   18.42;
        sigma1   1.0e-20;
        sigma2   5.0e4;
    }
    
    CO2_C
    {
        Aij      33.7;
        Bij      0.0263;
        offset   18.42;
        sigma1   1.0e-20;
        sigma2   5.0e4;
    }
    
    CO2_N2
    {
        Aij      45.4;
        Bij      0.0305;
        offset   18.42;
        sigma1   1.0e-20;
        sigma2   5.0e4;
    }
    
    CO2_CO
    {
        Aij      45.4;
        Bij      0.0305;
        offset   18.42;
        sigma1   1.0e-20;
        sigma2   5.0e4;
    }
    
    CO
    {
        Aij      198.0;
        Bij      0.029;
        offset   18.42;
        sigma1   3.0e-22;
        sigma2   5.0e4;
    }
    
    CO_N
    {
        Aij      47.7;
        Bij      0.05;
        offset   18.42;
        sigma1   3.0e-22;
        sigma2   5.0e4;
    }
    
    CO_O
    {
        Aij      47.7;
        Bij      0.05;
        offset   18.42;
        sigma1   3.0e-22;
        sigma2   5.0e4;
    }
    
    CO_C
    {
        Aij      47.7;
        Bij      0.05;
        offset   18.42;
        sigma1   3.0e-22;
        sigma2   5.0e4;
    }
    
    CO_N2
    {
        Aij      198.0;
        Bij      0.029;
        offset   18.42;
        sigma1   3.0e-22;
        sigma2   5.0e4;
    }
    
    CO_CO2
    {
        Aij      218.0;
        Bij      0.0305;
        offset   18.42;
        sigma1   3.0e-22;
        sigma2   5.0e4;
    }
    
    N2_C
    {
        Aij      72.4;
        Bij      0.015;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2_CO
    {
        Aij      221.0;
        Bij      0.029;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    N2_CO2
    {
        Aij      245.0;
        Bij      0.0305;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    // Argon (Park 1994)
    N2_Ar
    {
        Aij      240.0;
        Bij      0.0302;
        offset   18.42;
        sigma1   3.0e-21;
        sigma2   5.0e4;
    }
    
    CO2_Ar
    {
        Aij      50.3;
        Bij      0.0321;
        offset   18.42;
        sigma1   1.0e-20;
        sigma2   5.0e4;
    }
    
    CO_Ar
    {
        Aij      215.0;
        Bij      0.0302;
        offset   18.42;
        sigma1   3.0e-22;
        sigma2   5.0e4;
    }
}


SchwartzSlawskyHerzfeldCoefficients //- use with extreme caution
{
    Tlow           3000;
    Thigh          21000;
    
    LennardJonesParameters
    {
        N2_N2
        {
            sigma   (4.2 4.2);
            epsilonBykB (79.8 79.8);
        }
        
        N2_O2
        {
            sigma   (3.645 3.645);
            epsilonBykB (83.8 83.8);
        }
        
        O2_O2
        {
            sigma   (3.541 3.541);
            epsilonBykB (88.0 88.0);
        }
    }
    
    speciesData
    {
        N2
        {
            polarizability         1.71e-30; // http://cccbdb.nist.gov/exp2.asp?casno=7727379
            LVLInteratomicDistance 1.10;
        }
        
        O2
        {
            polarizability         1.562e-30; // http://cccbdb.nist.gov/exp2.asp?casno=7782447
            LVLInteratomicDistance 1.21;
        }
        
        NO
        {
            polarizability         1.698e-30; // http://cccbdb.nist.gov/exp1.asp
            LVLInteratomicDistance 1.154;
        }
    }
}


// V-V Models
//-----------

KnabCoefficients
{
    allSpecies
    {
        P21      0.01;
        sigma12  1.5e-18;
    }
    
    N2_O2
    {
        P21      0.01;
        sigma12  2.667e-19;
    }
    
    N2_NO
    {
        P21      0.01;
        sigma12  2.751e-19;
    }
    
    O2_NO
    {
        P21      0.01;
        sigma12  2.686e-19;
    }
}


// e-V Models
//-----------

BourdonVervischCoefficients
{
    Tlow           3000;
    Tmed           7000;
    Thigh          20000;
    
    allSpecies
    {
        BV1   (5.019 2.448);
        BV2   (-38.025 -18.704);
        BV3   (64.219 25.635);
    }
}    

