hydrogenReactingFlow/Coarse/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRho2Thermo;
    mixture         reacting2Mixture;
    transport       CEA;
    thermo          decoupledEnergyModes;
    energy          sensible2InternalEnergy;
    equationOfState perfect2Gas;
    specie          advancedSpecie;
}

hyLight no;

downgradeToSingleTv no;
downgradeToSingleTemperature yes;

chemistryReader foam2ChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/chemDicts/hTCReactionsES";

foamChemistryThermoFile "$FOAM_CASE/constant/myThermoDEM_TRVE";

twoTemperatureDictFile "$FOAM_CASE/constant/thermo2TModel";

temperatureBounds
{
    Tlow    200;
    Thigh   40000;
}

// ************************************************************************* //
